sf7ru/arsenal/beans/src/hal/stm32/f4xx/src/Stm32f4xxUart_freertos.c
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    PUARTDEF d = getUartDefByHandle(huart);


}

static void MY_USART_IRQHandler(PUARTDEF def)
{
    BaseType_t  xHigherPriorityTaskWoken    = pdFALSE;
    BOOL        doNotify                    = false;
    uint32_t    isrflags;
    uint32_t    errorflags;

    switch (def->mode)
    {
#ifdef HAL_SMARTCARD_MODULE_ENABLED
        case MODE_SMARTCARD:
            HAL_SMARTCARD_IRQHandler(&def->scdef);
            break;
#endif
        default:

            isrflags = def->addr->SR;

//            if (SR & USART_SR_TC)
//            {
//                def->addr->SR &= ~USART_SR_TC;
//
//            }

            if (isrflags & USART_SR_RXNE)
            {
                // Сбрасываем флаг прерывания
                def->addr->SR &= ~USART_SR_RXNE;

//                if (def->addr == USART1)
//                {
//                    //__asm__ __volatile__ ("bkpt #0");
//                    tmp =
//                }

                if (def->buff)
                {
                    U8 ch = def->addr->DR;
                    ringbuff_write(def->buff, &ch, 1);
                    doNotify = true;
                }
            }

            // Check for IDLE line interrupt
            if (LL_USART_IsActiveFlag_IDLE(def->addr))
            {
                LL_USART_ClearFlag_IDLE(def->addr);        // Clear IDLE line flag

                if (LL_USART_IsEnabledIT_IDLE(def->addr))
                {
                    if (def->dmarxbuff)
                    {
                        doNotify = usart_rx_check(def);                       // Check for data to process
                    }
                }
            }

            if (isrflags & USART_SR_FE)
            {
                __HAL_UART_CLEAR_FEFLAG(&def->def);
            }

            if (isrflags & USART_SR_PE)
            {
                __HAL_UART_CLEAR_PEFLAG(&def->def);
            }

            if (isrflags & USART_SR_NE)
            {
                __HAL_UART_CLEAR_NEFLAG(&def->def);
            }

            // Special case, LIN break detection.
            if (isrflags & USART_SR_LBD)
            {
                def->addr->SR &= ~USART_SR_LBD;
            }

            if (isrflags & USART_SR_ORE)
            {
                __HAL_UART_CLEAR_OREFLAG(&def->def);
            }

            break;
    }

    if (doNotify && def->xTaskToNotify)
    {
        vTaskNotifyGiveFromISR(def->xTaskToNotify, &xHigherPriorityTaskWoken);
        def->xTaskToNotify = nil;
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    }
}

void USART1_IRQHandler(void)
{
    MY_USART_IRQHandler(&globalUarts[0]);
}

void USART2_IRQHandler(void)
{
    MY_USART_IRQHandler(&globalUarts[1]);
}

void USART3_IRQHandler(void)
{
    MY_USART_IRQHandler(&globalUarts[2]);
}

void UART4_IRQHandler(void)
{
    MY_USART_IRQHandler(&globalUarts[3]);
}

void UART5_IRQHandler(void)
{
    MY_USART_IRQHandler(&globalUarts[4]);
}

void USART6_IRQHandler(void)
{
    MY_USART_IRQHandler(&globalUarts[5]);
}
static BOOL _MspInit(UINT port, SERIALTYPE type, UINT flags)
{
#define PP_OR_OD        (flags & SERIALFLAG_pushpull ? GPIO_MODE_AF_PP : GPIO_MODE_AF_OD)

    BOOL        result = true;

    GPIO_InitTypeDef GPIO_InitStruct;

    switch (port)
    {
        case 0:
            switch (type)
            {
                case SERIALTYPE_primary:
                    // Peripheral clock enable
                    __HAL_RCC_GPIOA_CLK_ENABLE();
                    __HAL_RCC_USART1_CLK_ENABLE();

                    /**USART1 GPIO Configuration
                    PA9     ------> USART1_TX
                    PA10     ------> USART1_RX
                    */
                    GPIO_InitStruct.Pin = (SERIALFLAG_rxonly & flags ? 0 : GPIO_PIN_9) | GPIO_PIN_10;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
                    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
                    break;

                case SERIALTYPE_secondary:
                    // Peripheral clock enable
                    __HAL_RCC_GPIOB_CLK_ENABLE();
                    __HAL_RCC_USART1_CLK_ENABLE();

                    /**USART1 GPIO Configuration
                    PB6     ------> USART1_TX
                    PB7     ------> USART1_RX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_6;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
                    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

                    GPIO_InitStruct.Pin = GPIO_PIN_7;
                    GPIO_InitStruct.Mode = PP_OR_OD;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
                    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
                    break;

                case SERIALTYPE_sc_secondary:
                    __HAL_RCC_GPIOB_CLK_ENABLE();
                    __HAL_RCC_USART1_CLK_ENABLE();
//                    __HAL_RCC_AFIO_CLK_ENABLE();
//                    __HAL_AFIO_REMAP_USART1_ENABLE();

                    /**USART1 GPIO Configuration
                    PB5     ------> USART1_CK
                    PB6     ------> USART1_TX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_5;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
                    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

                    GPIO_InitStruct.Pin = GPIO_PIN_6;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
                    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
                    break;

                default:
                    result = false;
                    break;
            }

            if (result)
            {
                HAL_NVIC_SetPriority(USART1_IRQn, 15, 0);
                HAL_NVIC_EnableIRQ(USART1_IRQn);
            }
            break;

        case 1:
            switch (type)
            {
                case SERIALTYPE_primary:

                    __HAL_RCC_GPIOA_CLK_ENABLE();
                    __HAL_RCC_USART2_CLK_ENABLE();

                    /**USART2 GPIO Configuration
                    PA2     ------> USART2_TX
                    PA3     ------> USART2_RX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_2|GPIO_PIN_3;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
                    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
                    break;

                case SERIALTYPE_sc_secondary:
                    __HAL_RCC_GPIOD_CLK_ENABLE();
                    __HAL_RCC_USART2_CLK_ENABLE();

                    /**USART2 GPIO Configuration
                    PD5     ------> USART2_TX
                    PD7     ------> USART2_CK
                    */
//                    GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_7;
//                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
//                    GPIO_InitStruct.Pull = GPIO_PULLUP;
//                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
//                    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
//                    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

                    GPIO_InitStruct.Pin = GPIO_PIN_5;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
                    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

                    GPIO_InitStruct.Pin = GPIO_PIN_7;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
                    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

                    break;

