sf7ru/arsenal/beans/src/hal/stm32/f4xx/src/Stm32f4xxUart_freertos.c
                case SERIALTYPE_secondary:
                    __HAL_RCC_GPIOD_CLK_ENABLE();
                    __HAL_RCC_USART2_CLK_ENABLE();

                    /**USART2 GPIO Configuration
                    PD5     ------> USART2_TX
                    PD6     ------> USART2_RX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_6;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
                    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

                    break;

                default:
                    result = false;
                    break;
            }

            if (result)
            {
                HAL_NVIC_SetPriority(USART2_IRQn, 5, 0);
                HAL_NVIC_EnableIRQ(USART2_IRQn);
            }
            break;

        case 2:
#ifdef USART3
            switch (type)
            {
                case SERIALTYPE_primary:

                    __HAL_RCC_GPIOD_CLK_ENABLE();
                    __HAL_RCC_USART3_CLK_ENABLE();

                    /**USART3 GPIO Configuration
                    PD8     ------> USART3_TX
                    PD9     ------> USART3_RX
                    */
                    GPIO_InitStruct.Pin       = GPIO_PIN_8 | GPIO_PIN_9;
                    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull      = GPIO_NOPULL;
                    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
                    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

                    result = true;
                    break;

                case SERIALTYPE_secondary:

                    __HAL_RCC_GPIOC_CLK_ENABLE();
                    __HAL_RCC_USART3_CLK_ENABLE();

                    /**UART3 GPIO Configuration
                    PC10     ------> UART3_TX
                    PC11     ------> UART3_RX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_NOPULL;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
                    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

                    result = true;
                    break;

                default:
                    break;
            }

            if (result)
            {
                HAL_NVIC_SetPriority(USART3_IRQn, 5, 0);
                HAL_NVIC_EnableIRQ(USART3_IRQn);
            }
#endif
            break;

        case 3:
#ifdef UART4
            switch (type)
            {
                case SERIALTYPE_primary:

                    __HAL_RCC_GPIOC_CLK_ENABLE();
                    __HAL_RCC_UART4_CLK_ENABLE();

                    /**UART4 GPIO Configuration
                    PC10     ------> UART4_TX
                    PC11     ------> UART4_RX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_NOPULL;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF8_UART4;
                    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

                    result = true;
                    break;

                default:
                    break;
            }

            if (result)
            {
                HAL_NVIC_SetPriority(UART4_IRQn, 5, 0);
                HAL_NVIC_EnableIRQ(UART4_IRQn);
            }
#endif
            break;

        case 4:
#ifdef UART5
            switch (type)
            {
                case SERIALTYPE_primary:

                    __HAL_RCC_GPIOC_CLK_ENABLE();
                    __HAL_RCC_UART5_CLK_ENABLE();

                    /**UART5 GPIO Configuration
                    PC12     ------> UART5_TX
                    PD2     ------> UART5_RX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_12;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_NOPULL;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF8_UART5;
                    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

                    GPIO_InitStruct.Pin = GPIO_PIN_2;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_NOPULL;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF8_UART5;
                    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

                    result = true;
                    break;

                default:
                    break;
            }

            if (result)
            {
                HAL_NVIC_SetPriority(UART5_IRQn, 5, 0);
                HAL_NVIC_EnableIRQ(UART5_IRQn);
            }
#endif
            break;

        case 5:
            switch (type)
            {
                case SERIALTYPE_primary:
                    // Peripheral clock enable
                    __HAL_RCC_GPIOC_CLK_ENABLE();
                    __HAL_RCC_USART6_CLK_ENABLE();

                    /**USART6 GPIO Configuration
                    PC6     ------> USART6_TX
                    PC7     ------> USART6_RX
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_6|GPIO_PIN_7;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
                    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
                    break;

                case SERIALTYPE_smartcard:
                    // Peripheral clock enable
                    __HAL_RCC_GPIOC_CLK_ENABLE();
                    __HAL_RCC_USART6_CLK_ENABLE();

                    /**USART6 GPIO Configuration
                    PC6     ------> USART6_TX
                    PC8     ------> USART6_CK
                    */
                    GPIO_InitStruct.Pin = GPIO_PIN_6;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
                    GPIO_InitStruct.Pull = GPIO_PULLUP;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
                    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

