sf7ru/arsenal/beans/src/hal/stm32/f4xx/src/Stm32f4xxUart_freertos.c
                    GPIO_InitStruct.Pin = GPIO_PIN_8;
                    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
                    GPIO_InitStruct.Pull = GPIO_NOPULL;
                    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
                    GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
                    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
                    break;

                default:
                    result = false;
                    break;
            }

            if (result)
            {
                HAL_NVIC_SetPriority(USART6_IRQn, 5, 0);
                HAL_NVIC_EnableIRQ(USART6_IRQn);
            }
            break;

        default:
            result = false;
            break;
    }

    return  result;

#undef PP_OR_OD
}
PVOID _serial_close(PVOID def)
{
    PUARTDEF    tmp         = (PUARTDEF)def;

    SAFEDESTROY(ringbuff, tmp->buff);

    return nil;
}
static void __XferCpltCallback(DMA_HandleTypeDef *      dmahf)
{
    usart_rx_check(getUartDefByDma(dmahf));
}

static PUARTDEF setUartDmaDef(PSERIALPROPS       p,
                              PUARTDEF           tmp)
{
    PUARTDEF        result          = nil;

    ENTER(true);

    tmp->mode                            = MODE_UART;
    tmp->def.Instance                    = tmp->addr;
    tmp->def.Init.BaudRate               = SERIALPROPS_UNBAUDRATE(p->u_baudrate);


    switch (p->u_bits + 4)
    {
#ifdef UART_WORDLENGTH_7B
        case 7:     tmp->def.Init.WordLength = UART_WORDLENGTH_7B;  break;
#endif
        case 9:     tmp->def.Init.WordLength = UART_WORDLENGTH_9B;  break;
        default:    tmp->def.Init.WordLength = UART_WORDLENGTH_8B;  break;
    }

    switch (p->u_stop)
    {
#ifdef UART_STOPBITS_1_5
        case SERIALSTOP_one_and_half:   tmp->def.Init.StopBits  = UART_STOPBITS_1_5;    break;
#endif
        case SERIALSTOP_two:            tmp->def.Init.StopBits  = UART_STOPBITS_2;      break;
#ifdef UART_STOPBITS_0_5
            case SERIALSTOP_half:           tmp->def.Init.StopBits  = UART_STOPBITS_0_5;    break;
#endif
        default:                        tmp->def.Init.StopBits  = UART_STOPBITS_1;      break;
    }

    switch (p->b_parity)
    {
        case SERIALPARITY_even:         tmp->def.Init.Parity    = UART_PARITY_EVEN;     break;
        case SERIALPARITY_odd:          tmp->def.Init.Parity    = UART_PARITY_ODD;      break;
        default:                        tmp->def.Init.Parity    = UART_PARITY_NONE;     break;
    }

    tmp->def.Init.Mode                   = UART_MODE_TX_RX;
    tmp->def.Init.HwFlowCtl              = UART_HWCONTROL_NONE;
    tmp->def.Init.OverSampling           = UART_OVERSAMPLING_16;
//    tmp->def.Init.OneBitSampling         = UART_ONE_BIT_SAMPLE_DISABLE;
//    tmp->def.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

    __HAL_RCC_DMA1_CLK_ENABLE();

    HAL_NVIC_SetPriority(tmp->dmaIrqN, 5, 0);
    HAL_NVIC_EnableIRQ(tmp->dmaIrqN);

    tmp->dmarx.Instance         = tmp->dmaStream;
    tmp->dmarx.Init.Channel     = tmp->dmaChannel;
    tmp->dmarx.Init.Direction   = DMA_PERIPH_TO_MEMORY;
    tmp->dmarx.Init.PeriphInc   = DMA_PINC_DISABLE;
    tmp->dmarx.Init.MemInc      = DMA_MINC_ENABLE;
    tmp->dmarx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    tmp->dmarx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    tmp->dmarx.Init.Mode        = DMA_CIRCULAR;
    tmp->dmarx.Init.Priority    = DMA_PRIORITY_MEDIUM;
    tmp->dmarx.Init.FIFOMode    = DMA_FIFOMODE_DISABLE;

    if ((tmp->dmarxbuff = (PU8)MALLOC(CBRD_UART_IN_BUFF_SZ)) != nil)
    {
        if (HAL_DMA_Init(&tmp->dmarx) != HAL_OK)
        {
            //_Error_Handler(__FILE__, __LINE__);
        }

        if (HAL_UART_Init(&tmp->def) == HAL_OK)
        {
            result = tmp;

            __HAL_LINKDMA(&tmp->def, hdmarx, tmp->dmarx);

            LL_USART_EnableIT_IDLE(tmp->addr);
            // FOR L4 and F0
//            LL_USART_EnableRxTimeout(tmp->addr);
//            LL_USART_SetRxTimeout(tmp->addr, 115);
//            LL_USART_EnableIT_RTO(tmp->addr);

//            tmp->dmarx.XferHalfCpltCallback = __XferCpltCallback;
//            tmp->dmarx.XferCpltCallback     = __XferCpltCallback;
            HAL_UART_Receive_DMA(&tmp->def, tmp->dmarxbuff, CBRD_UART_IN_BUFF_SZ);
        }
    }

    RETURN(result);
}
static PUARTDEF setUartDef(PSERIALPROPS       p,
                           PUARTDEF           tmp)
{
    PUARTDEF        result          = nil;

    ENTER(true);

    tmp->mode                            = MODE_UART;
    tmp->def.Instance                    = tmp->addr;
    tmp->def.Init.BaudRate               = SERIALPROPS_UNBAUDRATE(p->u_baudrate);


    switch (p->u_bits + 4)
    {
#ifdef UART_WORDLENGTH_7B
        case 7:     tmp->def.Init.WordLength = UART_WORDLENGTH_7B;  break;
#endif
        case 9:     tmp->def.Init.WordLength = UART_WORDLENGTH_9B;  break;
        default:    tmp->def.Init.WordLength = UART_WORDLENGTH_8B;  break;
    }

    switch (p->u_stop)
    {
#ifdef UART_STOPBITS_1_5
        case SERIALSTOP_one_and_half:   tmp->def.Init.StopBits  = UART_STOPBITS_1_5;    break;
#endif
        case SERIALSTOP_two:            tmp->def.Init.StopBits  = UART_STOPBITS_2;      break;
#ifdef UART_STOPBITS_0_5
        case SERIALSTOP_half:           tmp->def.Init.StopBits  = UART_STOPBITS_0_5;    break;
#endif
        default:                        tmp->def.Init.StopBits  = UART_STOPBITS_1;      break;
    }

    switch (p->b_parity)
    {
        case SERIALPARITY_even:         tmp->def.Init.Parity    = UART_PARITY_EVEN;     break;
        case SERIALPARITY_odd:          tmp->def.Init.Parity    = UART_PARITY_ODD;      break;
        default:                        tmp->def.Init.Parity    = UART_PARITY_NONE;     break;
    }

    tmp->def.Init.Mode                   = UART_MODE_TX_RX;
    tmp->def.Init.HwFlowCtl              = UART_HWCONTROL_NONE;
    tmp->def.Init.OverSampling           = UART_OVERSAMPLING_16;
//    tmp->def.Init.OneBitSampling         = UART_ONE_BIT_SAMPLE_DISABLE;
//    tmp->def.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

